[
    {
        "id": "1",
        "user_id": "1",
        "job_id": "2",
        "date_applied": "2024-08-25 10:00:00",
        "cover_letter": "I am very interested in the Software Engineer role. My experience in web development and software engineering makes me a strong candidate.",
        "custom_resume": "Experienced software developer with a background in web development. Proficient in Python and Java.",
        "application_status": "Under Review"
    },
    {
        "id": "2",
        "user_id": "6",
        "job_id": "4",
        "date_applied": "2024-08-28 09:00:00",
        "cover_letter": "I am applying for the DevOps Engineer position. My extensive experience in project management and IT infrastructure aligns well with this role.",
        "custom_resume": "Project manager with 5 years of experience in the IT industry. Specialized in DevOps practices.",
        "application_status": "Closed"
    },
    {
        "id": "3",
        "user_id": "4",
        "job_id": "3",
        "date_applied": "2024-08-20 14:00:00",
        "cover_letter": "I am excited about the Sales Executive Opportunity. My skills in data analysis and client relationship management will contribute to the sales targets.",
        "custom_resume": "Junior data analyst with proficiency in Python and SQL. Strong interpersonal skills.",
        "application_status": "Under Review"
    },
    {
        "id": "4",
        "user_id": "5",
        "job_id": "1",
        "date_applied": "2024-08-22 12:30:00",
        "cover_letter": "I am enthusiastic about the HR Manager Position. My experience in digital campaigns and marketing can bring fresh perspectives to HR processes.",
        "custom_resume": "Marketing specialist with a focus on digital campaigns and SEO.",
        "application_status": "Under Review"
    },
    {
        "id": "5",
        "user_id": "7",
        "job_id": "5",
        "date_applied": "2024-08-30 15:45:00",
        "cover_letter": "I am interested in the Recruitment Specialist Role. My background in graphic design allows me to bring creative solutions to recruitment strategies.",
        "custom_resume": "Graphic designer with a passion for creating visually appealing content. Experience in corporate branding.",
        "application_status": "Open"
    }
]